//package com.summit.common.entity;
//
///**
// * @author Administrator
// */
//public enum ResponseCodeBySummit {
//
//    //=============================系统通用报错================================
//
//    CODE_0000("操作成功"),
//    CODE_9999("服务端未知异常"),
//    CODE_9991("查询数据为空"),
//    CODE_9992("保存数据异常"),
//    CODE_9993("更新数据异常"),
//    CODE_9994("删除数据异常"),
//    CODE_9995("请求方式不正确"),
//    CODE_9996("请求的数据格式不正确"),
//    CODE_9997("更新数据失败，所更新的数据不存在"),
//    CODE_9998("删除数据失败，所删除的数据不存在"),
//    CODE_9981("删除数据失败，所删除的数据存在子集"),
//    CODE_9989("上传文件失败"),
//    CODE_9988("上传文件不能为空"),
//    CODE_9987("上传文件失败，文件最大不能超过10M"),
//    CODE_9986("输入字段有误！"),
//
//    //==============================配置管理相关================================
//    CODE_4007("访问此资源需要用户token"),
//    CODE_4008("无效的token。"),
//    CODE_4009("旧密码错误。"),
//    CODE_4010("用户名或密码错误，请联系系统管理员。"),
//    CODE_4011("用户登录异常，请重新登录"),
//    CODE_4012("用户权限不足"),
//    CODE_4023("用户名不存在"),
//    CODE_4024("用户状态未激活，请联系管理员进行激活用户"),
//    CODE_4025("角色信息为空！"),
//    CODE_4026("删除数据字典失败，操作的对象不存在！"),
//    CODE_4027("功能删除验证，该功能存在以下相应的资源"),
//    CODE_4028("组织机构删除验证，该机构存在以下相应的资源"),
//    CODE_4029("角色删除验证，该角色存在以下相应的资源"),
//    CODE_4030("操作失败，操作的对象不存在！"),
//    CODE_4031("删除失败，不能删除admin用户！"),
//    CODE_4033("新增失败，操作对象重复！"),
//    CODE_1001("保存测站普查表失败！");
//
//
//    private String description;
//
//    ResponseCodeBySummit(String description) {
//        this.description = description;
//    }
//
//    public String getDescription() {
//        return this.description;
//    }
//}
